openfoam/k77sf6/0/Ur
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ur;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
	opening
    {
        type                pressureInletOutletVelocity;
        value               uniform (0 0 0); 
    }       
	
    outlet
    {
        
        type            zeroGradient; 
         
    }
        
    "plate.*"
    {
        type            noSlip;
    }
	
    "pipe.*"
    {
        type            noSlip;
    }
	
	"rib.*"
    {
        type            noSlip; 
    }
	
    "wall.*"
    {
        type            noSlip; 
    }    
	
}

// ************************************************************************* //
