openfoam/k77sf6/0/a
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      a;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    opening
    {
        type            calculated;
        value           uniform 0; 
    }    
     
	
    outlet
    {
        type            zeroGradient; 
    }
    
    "plate.*"
    {
        type            zeroGradient; 
    }
	
    "pipe.*"
    {
        type            zeroGradient; 
    }
	
	"rib.*"
    {
        type            zeroGradient; 
    }
	
	
    "wall.*"
    {
        type            zeroGradient; 
    }
	
    	
}

// ************************************************************************* //
