openfoam/k77sf6/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
   opening
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0; 
    }
    	  
	
    outlet
    {
        
        type           zeroGradient;
        		
    }
        
    "plate.*"
    {
        type            zeroGradient; 
    }
	
    "pipe.*"
    {
        type            zeroGradient; 
    }
	
    "rib.*"
    {
        type            zeroGradient;
    }
	
    "wall.*"
    {
        type            zeroGradient;
    }
    
}

 

// ************************************************************************* //
