openfoam/k77sf6/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    opening
    {
        type            inletOutlet;
	phi	        rhoPhi; 
        inletValue      $internalField;
        value           $internalField; 
    }  
       
	
    outlet
    {
        type	zeroGradient;
    }
    
    "plate.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
	
    "pipe.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
	
	"rib.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
	
    "wall.*"
    {
       type            omegaWallFunction;
       value           $internalField; 
    }
    
		
}


// ************************************************************************* //
