openfoam/k77sf6/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    opening
    {
        
       type	totalPressure;
       p0	uniform 0;
       rho	rho;
       phi	rhoPhi;
       gamma	0; 
    }    
       
		
    outlet
    {
        type	fixedFluxPressure;
	
    }    
    
    "plate.*"
    {
        type            fixedFluxPressure;
        
    }
	
    "pipe.*"
    {
        type            fixedFluxPressure;
    }
        
	
	"rib.*"
    {
        type            fixedFluxPressure;
        
    }
	
    "wall.*"
    {
        type            fixedFluxPressure;
        
    }	
    	
}

// ************************************************************************* //
