openfoam/k77sf6/Allmesh1912
fluent3DMeshToFoam wrapperboi_solver.msh
checkMesh
