openfoam/k77sf6/Allrun1912
setFields
decomposePar
mpirun -np 30 renumberMesh -overwrite -parallel
mpirun -np 30 spillwayFlowVarRhoUr -parallel
reconstructPar
