openfoam/k77sf6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

#include "inputPar"

side #calc "$s/2-$r";
top  #calc "$x1+$depth";

// Gridresolution calculations
nh_air #calc "std::ceil(($x1)/$dx)";
nh_w #calc "std::ceil(($depth)/$dx)";
ns #calc "std::ceil(($s/2-$r)/$dx)";
n_jetw #calc "std::ceil(2*$r/$dx)";

vertices
(
 (0 0 0) //0
 ($side 0 0) //1
 (#calc "$side+2*$r" 0 0) //2
 ($s 0 0) //3
 
 (0 $depth 0) //4
 ($side $depth 0) //5
 (#calc "$side+2*$r" $depth 0) //6
 ($s $depth 0) //7

 (0 0 $width) //8
 ($side 0 $width) //9
 (#calc "$side+2*$r" 0 $width) //10
 ($s 0 $width) //11

 (0 $depth $width) //12
 ($side $depth $width) //13
 (#calc "$side+2*$r" $depth $width) //14
 ($s $depth $width) //15

 (0 $top 0) //16
 ($side $top 0) //17
 (#calc "$side+2*$r" $top 0) //18
 ($s $top 0) //19

 (0 $top $width) //20
 ($side $top $width) //21
 (#calc "$side+2*$r" $top $width) //22
 ($s $top $width) //23
);

blocks
(
      hex (0 1 5 4 8 9 13 12) ($ns $nh_w 1) simpleGrading (1 1 1)
      hex (1 2 6 5 9 10 14 13) ($n_jetw $nh_w 1) simpleGrading (1 1 1)
      hex (2 3 7 6 10 11 15 14) ($ns $nh_w 1) simpleGrading (1 1 1)

      hex (4 5 17 16 12 13 21 20) ($ns $nh_air 1) simpleGrading (1 1 1)
      hex (5 6 18 17 13 14 22 21) ($n_jetw $nh_air 1) simpleGrading (1 1 1)
      hex (6 7 19 18 14 15 23 22) ($ns $nh_air 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
	 (16 17 21 20)
	 (18 19 23 22)
	 (4 16 20 12)
	 (7 19 23 15)
        );
    }
    inletWaterJet
    {
      type patch;
        faces
        (
	 (17 18 22 21)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 8 9 1)
	    (1 9 10 2)
	    (2 10 11 3)
	    (0 4 12 8)
	    (3 7 15 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
    	    (0 1 5 4)
	    (1 2 6 5)
	    (2 3 7 6)
	    (4 5 17 16)
	    (5 6 18 17)
	    (6 7 19 18)

	    (8 9 13 12)
	    (9 10 14 13)
	    (10 11 15 14)
	    (12 13 21 20)
	    (13 14 22 21)
	    (14 15 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
