openfoam/k77sf6/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     spillwayFlowVarRhoUr;

startFrom       startTime; //startTime, latestTime

startTime       0;

stopAt          endTime;//endTime; writeNow

endTime         8;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

//writeCompression uncompressed;

timeFormat      general;

timePrecision   9;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       0.001;

libs
(
"libturbulenceDamping.so"
);


functions
{
}


// ************************************************************************* //
